; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v7 - type_1 ?v8 - type_3)
 	      (pred_4 ?v6 - object ?v8 - type_3)
	      (pred_2 ?v7 - type_1 ?v1 - type_2)
	      (pred_3 ?v7 - type_1 ?v6 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v7 - type_1 ?v5 ?v3 - type_3)
       :precondition (and  (pred_1 ?v7 ?v5))
       :effect (and  (pred_1 ?v7 ?v3)
		     (not (pred_1 ?v7 ?v5))))

   (:action op_1
       :parameters (?v7 - type_1 ?v2 - object ?v4 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v4) (pred_1 ?v7 ?v4) (pred_2 ?v7 ?v1))
       :effect (and (pred_3 ?v7 ?v2 ?v1)
		    (not (pred_4 ?v2 ?v4)) 
		    (not (pred_2 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_1 ?v2 - object ?v4 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v2 ?v1) (pred_1 ?v7 ?v4))
       :effect (and (pred_4 ?v2 ?v4)
		    (pred_2 ?v7 ?v1)
		    (not (pred_3 ?v7 ?v2 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_01 - type_1
obj_04 obj_11 obj_10 obj_05 - type_2
obj_03 obj_02 obj_12 - type_3
obj_09 obj_07 obj_06 - object)
(:init
(pred_1 obj_08 obj_12)
(pred_2 obj_08 obj_04)
(pred_2 obj_08 obj_11)
(pred_1 obj_01 obj_02)
(pred_2 obj_01 obj_10)
(pred_2 obj_01 obj_05)
(pred_4 obj_09 obj_12)
(pred_4 obj_07 obj_03)
(pred_4 obj_06 obj_12)
)
(:goal
(and
(pred_4 obj_09 obj_03)
(pred_4 obj_07 obj_02)
(pred_4 obj_06 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_08 obj_03) (pred_1 obj_01 obj_03))))
  )
)
)

; plan
1. (op_1 obj_08 obj_09 obj_12 obj_11)
   deleted: (pred_4 obj_09 obj_12) (pred_2 obj_08 obj_11)
   added: (pred_3 obj_08 obj_09 obj_11)
   goals met: 0 of 3
2. (op_1 obj_08 obj_06 obj_12 obj_04)
   deleted: (pred_4 obj_06 obj_12) (pred_2 obj_08 obj_04)
   added: (pred_3 obj_08 obj_06 obj_04)
   goals met: 0 of 3
3. (op_3 obj_08 obj_12 obj_03)
   deleted: (pred_1 obj_08 obj_12)
   added: (pred_1 obj_08 obj_03)
   goals met: 0 of 3
4. (op_2 obj_08 obj_09 obj_03 obj_11)
   deleted: (pred_3 obj_08 obj_09 obj_11)
   added: (pred_4 obj_09 obj_03) (pred_2 obj_08 obj_11)
   goals met: 1 of 3
5. (op_2 obj_08 obj_06 obj_03 obj_04)
   deleted: (pred_3 obj_08 obj_06 obj_04)
   added: (pred_4 obj_06 obj_03) (pred_2 obj_08 obj_04)
   goals met: 2 of 3
6. (op_1 obj_08 obj_07 obj_03 obj_11)
   deleted: (pred_4 obj_07 obj_03) (pred_2 obj_08 obj_11)
   added: (pred_3 obj_08 obj_07 obj_11)
   goals met: 2 of 3
7. (op_3 obj_08 obj_03 obj_02)
   deleted: (pred_1 obj_08 obj_03)
   added: (pred_1 obj_08 obj_02)
   goals met: 2 of 3
8. (op_2 obj_08 obj_07 obj_02 obj_11)
   deleted: (pred_3 obj_08 obj_07 obj_11)
   added: (pred_4 obj_07 obj_02) (pred_2 obj_08 obj_11)
   goals met: 3 of 3
